Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Within expressions and non-expressions alike, integers may be written in either hexadecimal or decimal format.
ja: 式の中でもそうでなくても、整数は16進数と10進数のどちらの形式でも書くことができます。

source: Within expressions, unquoted literal numbers such as 128, 0x7F and 1.0 are converted to pure numbers before the script begins executing, so converting the number to a string may produce a value different to the original literal value.
ja: 式の中では128、0x7F、1.0などの引用符で囲まれていないリテラル数値はスクリプトの実行を開始する前に純粋な数値に変換されるため、数値を文字列に変換すると元のリテラル値とは異なる値が生成される可能性があります。

source: Within the loop's body, use the FileAppend function without the Filename parameter (i.e. omit it) to append to this special file.
ja: ループのボディ内で、FileAppend関数をFilenameパラメータなしで（つまり省略）使用し、この特別なファイルに追記します。

source: Within this documentation, the word "class" on its own usually means a class object constructed with the class keyword.
ja: この文書では、「クラス」という単語は通常、classキーワードで構築されたクラス・オブジェクトを意味する。

source: Within this documentation, there are many examples in code blocks such as the one below.
ja: このドキュメントの中には、以下のようなコードブロックの例がたくさんあります。

source: Without Wrap, the control stops when the minimum or maximum is reached.
ja: ラップなしでは、コントロールは最小または最大に達すると停止する。

source: Without the asterisk, the user would be forced to select a folder inside StartingFolder (or StartingFolder itself).
ja: アスタリスクがない場合、ユーザーはStartingFolder内のフォルダ（またはStartingFolder自体）を選択するよう強制されます。

source: Without them, only the first line in the block is called.
ja: これがないと、ブロックの最初の行だけが呼び出される。

source: Without them, programming and scripting would be much more tedious.
ja: それがなければ、プログラミングやスクリプトはもっと退屈なものになるだろう。

source: Without this option, $ instead matches right before the final newline (if there is one).
ja: このオプションがない場合、$は最後の改行の直前（改行がある場合）にマッチする。

source: Without this option, a backslash followed by a letter with no special meaning is treated as a literal (e.g. \g and g are both recognized as a literal g).
ja: このオプションがない場合、バックスラッシュの後に特別な意味を持たない文字が続いても、リテラルとして扱われる（例えば、 \g と g は両方ともリテラル g として認識される）。

source: Without this style, the scroll bar is hidden when the drop-down list does not contain enough items.
ja: このスタイルがないと、ドロップダウンリストに十分な項目がない場合にスクロールバーが非表示になります。

source: Words that are longer than the width of the control are truncated.
ja: コントロールの幅より長い単語は切り捨てられる。

source: Words that extend past the end of a line are automatically wrapped to the beginning of the next left-aligned line.
ja: 行末からはみ出した単語は、自動的に次の左揃えの行頭に折り返される。

source: Workarounds
ja: 回避策

source: Works like a charm!
ja: 魅力的に機能する！

source: Wrapping a COM interface pointer allows the script to take advantage of automatic reference counting.
ja: COMインターフェイスポインターをラップすることで、スクリプトが自動参照カウントを利用することができます。

source: Wrapping a COM object enables the script to interact with it more naturally, using object syntax.
ja: COMオブジェクトをラッピングすることで、スクリプトはオブジェクトの構文を使用して、より自然にオブジェクトと対話することができます。

source: Wrapping a COM object or SafeArray enables the script to interact with it more naturally, using object syntax.
ja: COMオブジェクトやSafeArrayをラッピングすることで、スクリプトがオブジェクトの構文を使用して、より自然に操作することができます。

source: Wraps a raw IDispatch pointer (COM object) for use by the script.
ja: スクリプトが使用する生のIDispatchポインター（COMオブジェクト）をラップします。

source: Wraps a value, SafeArray or COM object for use by the script or for passing to a COM method.
ja: スクリプトで使用するため、またはCOMメソッドに渡すために、値、SafeArrayまたはCOMオブジェクトをラップします。

source: Wraps the text to multiple lines if the text is too long to fit on a single line in the control's available width.
ja: テキストが長すぎてコントロールの使用可能な幅で1行に収まらないときに折り返して複数行にします。

source: Write the function's parameter list (optionally preceded by a function name) to the left of the operator.
ja: 関数のパラメータ・リスト（オプションで関数名を前に付ける）を演算子の左に書く。

source: Writes a multi-line string to the registry.
ja: レジストリに複数行の文字列を書き込みます。

source: Writes a number to the file and advances the file pointer.
ja: ファイルに数値を書き込み、ファイルポインタを進める。

source: Writes a string of characters followed by `n or `r`n depending on the flags used to open the file.
ja: 文字列の後に、ファイルを開くときに使用したフラグに応じて`nまたは`r`nが続くように書き込みます。

source: Writes a string of characters to the file and advances the file pointer.
ja: 文字列をファイルに書き込み、ファイルポインタを進める。

source: Writes a string to the registry.
ja: レジストリに文字列を書き込みます。

source: Writes a value or section to a standard format .ini file.
ja: 標準形式の .ini ファイルに値またはセクションを書き込みます。

source: Writes a value to a variable contained in the environment.
ja: 環境に含まれる変数に値を書き込みます。

source: Writes a value to a key located in section2 of a standard format .ini file.
ja: 標準フォーマットの.iniファイルのsection2にあるキーに値を書き込みます。

source: Writes a value to the registry.
ja: レジストリに値を書き込みます。

source: Writes a value to the specified environment variable.
ja: 指定した環境変数に値を設定します。

source: Writes binary data to the registry.
ja: レジストリにバイナリデータを書き込みます。

source: Writes raw binary data to the file and advances the file pointer.
ja: ファイルに生のバイナリデータを書き込み、ファイルポインタを進める。

source: Writes some text to a file then reads it back into memory (it provides the same functionality as this DllCall example).
ja: ファイルにテキストを書き込み、それをメモリに読み戻します（このDllCallの例と同じ機能を提供します）。

source: Writes some text to a file then reads it back into memory.
ja: ファイルにテキストを書き、それをメモリに読み戻す。

source: Writes some text to an environment variable.
ja: 環境変数に文字列を書き込みます。

source: Writes some text to the AutGUI variable contained in the environment.
ja: 環境に含まれるAutGUI変数にテキストを書き込みます。

source: Writes text or binary data to the end of a file (first creating the file, if necessary).
ja: テキストまたはバイナリデータをファイルの末尾に書き込みます（必要に応じて、最初にファイルを作成します）。

source: Writes to the current item.
ja: 現在のアイテムに書き込みます。

source: X and Y are in screen coordinates.
ja: X、Yはスクリーン座標で表示されます。

source: X and Y are relative to the active window's client area by default.
ja: XとYは、デフォルトではアクティブウィンドウのクライアント領域からの相対値です。

source: X+n or XP+nonzero
ja: X+n または XP+ノンゼロ

source: X1 (XButton1, the 4th mouse button) and X2 (XButton2, the 5th mouse button) are also supported.
ja: X1（XButton1、マウス第4ボタン）、X2（XButton2、マウス第5ボタン）にも対応しています。

source: Xn or XM
ja: Xn または XM

source: XDebugClient should automatically open the script file.
ja: XDebugClientは自動的にスクリプトファイルを開くはずです。

source: XDebugClient was originally designed for PHP with Xdebug, but a custom build compatible with AutoHotkey is available below.
ja: XDebugClientはもともとXdebugでPHP用に設計されたものですが、AutoHotkeyと互換性のあるカスタムビルドを以下に公開します。

source: XP or XP+0
ja: XP または XP+0

source: XS and YS may optionally be followed by a plus/minus sign and a number.
ja: XSとYSの後には、オプションでプラス・マイナス記号と数字を付けることができます。

source: Y+n or YP+nonzero
ja: Y+n または YP+ノンゼロ

source: Yn or YM
ja: Yn または YM

source: YP or YP+0
ja: YP または YP+0

source: YYYYMMDDHH24MISS timestamp values are now considered invalid if their length is not an even number between 4 and 14 (inclusive).
ja: YYYYMMDDHH24MISSタイムスタンプ値の長さが4～14の偶数でない場合、無効と判断されるようになりました（包括的）。

source: YYYYMMDDHHMISS := DateAdd(YYYYMMDDHHMISS, UTC_Delta, "Minutes") ; Apply offset to convert to UTC.
ja: YYYYMMDDHHMISS := DateAdd(YYYYMMDDHHMISS, UTC_Delta, "Minutes") ; UTC に変換するためのオフセットを適用します。

source: Year and month format for the current user's locale, such as February, 2004
ja: 現在のユーザーのロケールに合わせた年・月のフォーマット（例：February, 2004）

source: Year with century.
ja: 西暦（4桁）。

source: Year without century, with leading zero (00 – 99)
ja: 西暦（下2桁の先頭ゼロあり）（00～99）

source: Year without century, without leading zero (0 – 99)
ja: 西暦（下2桁の先頭ゼロなし）（0～99）

source: Years less than 1601 are not considered valid because the operating system generally does not support them.
ja: 1601年未満の年号は、OSが一般的にサポートしていないため、有効な年号とはみなされません。

source: Years prior to 1601 are not supported.
ja: 1601年以前はサポート対象外です。

source: Yellow
ja: Yellow（黄色）

source: Yes, No
ja: はい(Y)、いいえ(N)

source: Yes, No, Cancel
ja: はい(Y)、いいえ(N)、キャンセル

source: Yes, they do!
ja: そうだ！

source: You are not responsible for enforcing compliance by third parties to this License.
ja: あなたは、第三者による本使用許諾の遵守を強制する責任を負いません。

source: You are using MyVar to store the return value of the function that is to the right of the := operator.
ja: MyVarは、:=演算子の右側にある関数の戻り値を格納するために使用しています。

source: You can also alternate the quote marks:
ja: 引用符を交互に並べることも可能です：

source: You can also combine a keyboard key with a mouse button.
ja: また、キーボードのキーとマウスのボタンを組み合わせることもできます。

source: You can also edit the replacement text if you wish.
ja: また、必要に応じて、置換テキストを編集することもできます。

source: You can also pipe the output directly to the clipboard by using the operating system's built-in clip command.
ja: また、オペレーティングシステムに内蔵されたクリップコマンドを使用すれば、出力を直接クリップボードにパイプすることができます。

source: You can also specify a variadic parameter to compare multiple values within an array.
ja: また、配列内の複数の値を比較するために、variadicパラメータを指定することができます。

source: You can also specify a negative Length to omit that many characters from the end of the returned string (an empty string is returned if all or too many characters are omitted).
ja: また、負のLengthを指定すると、返される文字列の末尾からその文字数だけ文字列を省略することができます（すべての文字が省略された場合、または文字数が多すぎる場合は、空の文字列が返されます）。

source: You can also try searching the forum for a keywords like RawInput*, USB HID or AHKHID.
ja: また、RawInput*、USB HIDまたはAHKHIDなどのキーワードでフォーラムを検索してみるのもよいでしょう。

source: You can call another functions inside them (note that these function calls must be specified with parentheses as they are not at the start of the line):
ja: その中で別の関数を呼び出すことができます（これらの関数呼び出しは行頭ではないので、括弧で指定しなければならないことに注意）：

source: You can change the action by replacing the Send "=" line with line(s) of your choice.
ja: Send "="の行を好きな行に置き換えることで、アクションを変更することができる。

source: You can change where the tooltips are displayed by using the TBM_SETTIPSIDE message.
ja: TBM_SETTIPSIDEメッセージを使って、ツールチップを表示する場所を変更できます。

source: You can check whether hot-track selection is enabled by calling SystemParametersInfo.
ja: ホットトラック選択が有効かどうかは、SystemParametersInfo を呼び出すことで確認できる。

source: You can compare A_Language directly to one or more of the 4-digit codes below; for example:
ja: A_Languageを以下の4桁コードと直接比較することができます：

source: You can compare A_Language directly to one or more of the 4-digit codes below; for example: if (A_Language = "0436").
ja: A_Languageは、4桁コードと直接比較することができます。例えば：if (A_Language = "0436")。

source: You can copy and paste most examples on this page.
ja: このページのほとんどの例をコピー＆ペーストできます。

source: You can define a custom combination of two (and only two) keys (except controller buttons) by using & between them.
ja: キーとキーの間に & を使用することで、2つのキー（コントローラーボタンは除く）のカスタムコンビネーションを定義することができます。

source: You can determine if your script is using the hooks via the KeyHistory function or menu item.
ja: スクリプトがフックを使用しているかどうかは、KeyHistory関数またはメニュー項目で確認できます。

source: You can determine whether a script is using the hook via the KeyHistory function or menu item.
ja: スクリプトがフックを使用しているかどうかは、KeyHistory関数またはメニュー項目で確認できます。

source: You can determine whether this has happened by opening the script's main window via the tray icon (unless you've disabled it).
ja: トレイアイコンからスクリプトのメインウィンドウを開くことで、この現象が起きているかどうかを判断できます（ただし、トレイアイコンを無効にしている場合は除く）。

source: You can determine which hotkeys are using the hook via the ListHotkeys function or menu item.
ja: どのホットキーがフックを使用しているかは、ListHotkeys関数またはメニュー項目で確認することができます。

source: You can disable all built-in Windows hotkeys except Win+L and Win+U by making the following change to the registry (this should work on all OSes but a reboot is probably required):
ja: レジストリを次のように変更することでWin+LとWin+U以外のすべてのWindowsのホットキーを無効にすることができます（全てののOSで動作するはずですが、おそらく再起動が必要です）：

source: You can do math in them:
ja: その中で算術計算ができます：

source: You can do that by right clicking on the script's tray icon and selecting Exit.
ja: スクリプトのトレイアイコンを右クリックし、終了を選択することで可能です。

source: You can even do the above without losing the native function of the right Alt by assigning the right Alt to be a "prefix" for at least one other hotkey.
ja: 右Altを少なくとも1つの他のホットキーの「接頭辞」に割り当てることで、右Altの本来の機能を失わずに上記のことを行うことも可能です。

source: You can find Window Spy in the script's tray menu or the AutoHotkey Dash.
ja: Window Spyは、スクリプトのトレイメニューまたはAutoHotkey Dashで見つけることができます。

source: You can find out if your script uses either hook via "View->Key History" in the script's main window (accessible via "Open" in the tray icon).
ja: スクリプトがどちらのフックを使用しているかは、スクリプトのメインウィンドウの「View->Key History」（トレイアイコンの「Open」からアクセスできます）で確認できます。

source: You can force either or both of the hooks to be installed by adding the InstallKeybdHook and InstallMouseHook functions to the script.
ja: スクリプトにInstallKeybdHook関数とInstallMouseHook関数を追加することで、どちらかまたは両方のフックを強制的にインストールさせることができます。

source: You can force interruptions to occur immediately by means of a delay such as a Sleep -1 or a WinWait for a window that does not yet exist.
ja: Sleep -1や、まだ存在しないウィンドウのWinWaitなどのディレイによって、強制的に割り込みを即座に発生させることができます。

source: You can force the hooks to be installed by adding either or both of the following lines to the script:
ja: 以下の行のどちらか、または両方をスクリプトに追加することで、フックを強制的にインストールさせることができます：

source: You can force the hooks to be installed by calling InstallKeybdHook and/or InstallMouseHook.
ja: InstallKeybdHookおよび/またはInstallMouseHookを呼び出すことで、フックを強制的にインストールすることができます。

source: You can get more keys and use them to access the same unit, but when you're finished with the unit, you must hand all keys back to the rental agent.
ja: 鍵の数を増やして、同じユニットにアクセスするために使用することができますが、ユニットを使い終わったら、すべての鍵をレンタルエージェントに返さなければなりません。

source: You can instead assign it to a hotkey to test its effect on whatever window you want.
ja: その代わり、ホットキーに割り当てて、好きなウィンドウで効果を試すことができます。

source: You can omit one or more parameters from the end of the callback's parameter list if the corresponding information is not needed, but in this case an asterisk must be specified as the final parameter, e.g. MyCallback(Param1, *).
ja: 対応する情報が不要な場合、コールバックのパラメータリストの最後から1つ以上のパラメータを省略することができますが、この場合、MyCallback(Param1, *)のように、最後のパラメータとしてアスタリスクを指定する必要があります。

source: You can omit one or more parameters from the end of the list if the corresponding information is not needed, but in this case an asterisk must be specified as the final parameter.
ja: 対応する情報が不要な場合、リストの最後から1つ以上のパラメータを省略することができますが、この場合、最後のパラメータとしてアスタリスクを指定する必要があります。

source: You can omit the callback's parameter if the corresponding information is not needed, but in this case an asterisk must be specified, e.g. MyCallback(*).
ja: 対応する情報が必要ないときはコールバックのパラメータを省略することができますが、その場合はMyCallback(*)のようにアスタリスクを指定する必要があります。

source: You can personalize various settings at the top of the script.
ja: スクリプトの上部でさまざまな設定をパーソナライズできる。

source: You can reduce or eliminate the need for this variable with one of the following:
ja: 以下のいずれかで、この変数の必要性を低減または排除することができます：

source: You can see a list of them at the command prompt by typing SET then pressing Enter.
ja: コマンドプロンプトで「SET」と入力してEnterを押すと、その一覧を見ることができます。

source: You can tell if a script has the keyboard hook by opening its main window and selecting "View->Key history" from the menu bar.
ja: スクリプトにキーボードフックがあるかどうかは、スクリプトのメインウィンドウを開き、メニューバーから「表示->キー履歴」を選択することで確認できます。

source: You can then type a name for the script (taking care not to erase the .ahk extension if it is visible).
ja: 次に、スクリプトの名前を入力します（拡張子.ahkが表示されている場合は、消さないように注意してください）。

source: You can think of the function call itself as a substitute for the result of the function.
ja: 関数の呼び出しそのものが、関数の結果の代用品と考えることができます。

source: You can try out any of the above examples by copying them into a new text file such as "Override.ahk", then launching the file.
ja: 上記の例を「Override.ahk」のような新しいテキストファイルにコピーし、そのファイルを起動すますることで試すことができます。

source: You can try out any of these examples by copying them into a new text file such as "Remap.ahk", then launching the file.
ja: これらの例を「Remap.ahk」のような新しいテキストファイルにコピーし、ファイルを起動することで試すことができる。

source: You can use the following modifier symbols to define hotkeys:
ja: 以下の修飾記号を使用して、ホットキーを定義：

source: You can use the shades-of-variation option (*n) to help make the behavior consistent across multiple color depths.
ja: shades-of-variationオプション（*n）を使用することで、複数の色深度での動作の一貫性を持たせることができます。

source: You can usually edit a script file by right clicking it and selecting Edit Script.
ja: 通常、スクリプトファイルを右クリックして「スクリプトの編集」を選択することで編集できます。

source: You can.
ja: できます。

source: You could similarly create the above object with thing := {foo:
ja: 上記のオブジェクトはthing := {foo:

source: You could similarly create the above object with thing := {foo: "bar"}.
ja: 上記のオブジェクトはthing := {foo: "bar"}でも同様に作成できる。

source: You define the condition by writing an expression which is evaluated whenever you press the hotkey.
ja: ホットキーを押すたびに評価される式を書くことで、条件を定義することができます。

source: You do not need to wrap common letters, numbers or even some symbols such as . (period) in curly brackets.
ja: 一般的な文字や数字、あるいは.（ピリオド）のような記号を中カッコで囲む必要はない。

source: You don't know where an object's code or variables actually reside, so you must pass a message to the object, like "give me foo" or "go do bar", and rely on the object to respond to the message.
ja: オブジェクトのコードや変数が実際にどこにあるのかわからないので、「fooを要求」「barの実行に遷移」といったメッセージをオブジェクトに渡し、オブジェクトがそのメッセージに応答するのを待つしかない。

source: You have a list of things where each thing has a name, such as the characteristics of a fruit (this would be referred to as an associative array)
ja: 果物の特徴のように、それぞれのものに名前がついているもののリストがある（これは連想配列と呼ばれる）

source: You may also omit the period to achieve the same result (except where ambiguous such as x -y, or when the item on the right side has a leading ++ or --).
ja: ピリオドを省略しても同じ結果が得られる x -yのように曖昧な場合や、右側の項目の先頭に ++ や -- がある場合を除く）。

source: You may charge a fee for the physical act of transferring a copy, and you may at your option offer warranty protection in exchange for a fee.
ja: あなたは、コピーを譲渡する物理的な行為に対して手数料を請求することができます。また、あなたの選択により、手数料と引き換えに保証保護を提供することができます。

source: You may not impose any further restrictions on the recipients' exercise of the rights granted herein.
ja: お客様は、本契約で付与された権利を受信者が行使することについて、いかなる制限も課すことはできません。

source: You may receive one or more security prompts, depending on several factors.
ja: いくつかの要因によって、1つまたは複数のセキュリティプロンプトが表示される場合があります。

source: You might be wondering "How the crud am I supposed to know that ^ means Ctrl?!".
ja: 「どうやって^がCtrlを意味することを知るんだ！」と思うかもしれません。

source: You might find that complex functions are more readable and maintainable if their special variables are given a distinct prefix.
ja: 複雑な関数は、特殊な変数に明確な接頭辞をつけると読みやすく、保守しやすくなります。

source: You must make sure that they, too, receive or can get the source code.
ja: 彼らもソースコードを受け取るか、入手できるようにしなければならない。

source: You need to fix the error in your script before you can get your tray icon back.
ja: トレイアイコンを取り戻すには、スクリプトのエラーを修正する必要があります。

source: You should also try running the game in windowed mode, if possible.
ja: また、可能であれば、ウィンドウモードでゲームを実行してみてください。

source: You should be presented with an option for each major version of AutoHotkey.
ja: AutoHotkeyの各メジャーバージョンのオプションが表示されるはずです。

source: You should get a prompt asking whether you want to install with default options.
ja: デフォルトのオプションでインストールするかどうかを尋ねるプロンプトが表示されるはずです。

source: You want to have a numbered list of things, such as a grocery list (this would be referred to as an indexed array)
ja: 食料品リストのような、番号付けされたリストを持ちたい場合（これは添字付き配列と呼ばれます）

source: You want to represent a grid, perhaps for a board game (this would be done with nested objects)
ja: おそらくボードゲーム用のグリッドを表現したい（これはネストされたオブジェクトで行われるだろう）

source: You will learn a lot this way by reading the documentation, reading errors and learning what works and what doesn't.
ja: ドキュメントを読み、エラーを読み、何が機能し、何が機能しないかを学ぶことで、この方法で多くを学ぶことができる。

source: You'll find that there's a message saying 'Control ID:
ja: コントロールIDというメッセージが表示されます：：

source: Your Documents (or My Documents) folder.
ja: あなたのドキュメント（またはマイドキュメント）」フォルダー。

source: Your code will run perfectly fine without it, but it will be a major headache for you and other to read your code.
ja: あなたのコードはこれなしでもまったく問題なく動くが、あなたにとっても他の人にとっても、あなたのコードを読むのは大きな頭痛の種になるだろう。

source: Your first script is done.
ja: 最初のスクリプトは完成しました。

source: Yu Gothic
ja: 游ゴシック

source: Yu Gothic UI
ja: 游 ゴシック UI

source: Yu Mincho
ja: 游

source: Zero (0) means success, but any other number means the call failed.
ja: ゼロ（0）は成功を、それ以外の数値は呼び出しが失敗したことを意味します。

source: Zero is recommended for most purposes since it is fast but still cooperates well with other processes (due to internally doing a Sleep 0).
ja: Zeroは高速でありながら、他のプロセスとの協調性が高いため（内部的にSleep 0を行うため）、ほとんどの用途で推奨されます。

source: Zero is returned if the pattern is not found.
ja: パターンが見つからない場合は0が返される。

source: Zero is traditionally used to indicate success.
ja: ゼロは従来、成功を示すために使われてきた。

source: Zero or more parameters which may affect what action is carried out, how a value is stored, or which value is returned.
ja: どのようなアクションが実行されるか、どのように値が保存されるか、どの値が返されるかに影響を与える可能性のあるゼロまたは複数のパラメータ。

source: Zero or more flags from the flag table below to affect output justification and prefixes.
ja: 以下のフラグテーブルから0個以上のフラグを指定し、出力の正当化および接頭辞に影響を与える。

source: Zero or more of the following options may be specified immediately in front of the filename:
ja: ファイル名の直前に、以下のオプションを0個以上指定することができます：

source: Zero or more of the following options may be specified immediately in front of the filename: *wN (width N), *hN (height N), and *IconN (icon group number N in a DLL or EXE file).
ja: ファイル名の直前に、以下のオプションを0個以上指定することができます：*wN（幅N）、*hN（高さN）、*IconN（DLLまたはEXEファイル内のアイコン群番号N）です。

source: Zero or more of the following strings may be also be present immediately before the name of the file.
ja: ファイル名の直前には、以下の文字列が0個以上存在してもよい。

source: Zero or more of the following strings may be present in Options (specify each number as decimal, not hexadecimal):
ja: オプションには、以下の文字列を0個以上指定することができます（各数値は16進数ではなく10進数で指定してください）：

source: Zero or more of the following strings.
ja: 以下の文字列のうち、0個以上。

source: Zero or more options.
ja: 選択肢は0個以上。

source: ZeroPaddedNumber := Buffer(20) ; Ensure the buffer is large enough to accept the new string.
ja: ZeroPaddedNumber := Buffer(20) ; バッファが新しい文字列を受け入れるのに十分な大きさであることを確認します。

source: Zip Installer
ja: Zipインストーラー

source: ["#Directives","",
ja: ["#指示","",

source: ["Array Object","lib/Array.htm"],
ja: ["Arrayオブジェクト","lib/Array.htm"],

source: ["Binary Compatibility","Compat.htm"],
ja: ["バイナリ互換性","Compat.htm"],

source: ["Buffer Object","lib/Buffer.htm"],
ja: ["Bufferオブジェクト","lib/Buffer.htm"],

source: ["Changes from v1.0 to v1.1","v1-changes.htm"],
ja: ["v1.0 から v1.1 への変更","v1-changes.htm"],

source: ["Changes from v1.1 to v2.0","v2-changes.htm"],
ja: ["v1.1 から v2.0 への変更","v2-changes.htm"],

source: ["Class Object","lib/Class.htm"],
ja: ["Classオブジェクト","lib/Class.htm"],

source: ["Compiler Directives","misc/Ahk2ExeDirectives.htm"],
ja: ["コンパイラ指令","misc/Ahk2ExeDirectives.htm"],

source: ["Concepts and Conventions","Concepts.htm"],
ja: ["概念と規約","Concepts.htm"],

source: ["Debugging Clients","AHKL_DBGPClients.htm"],
ja: ["クライアントのデバッグ","AHKL_DBGPClients.htm"],

source: ["Drive", "lib/Drive.htm",
ja: ["ドライブ", "lib/Drive.htm",

source: ["Editors with AHK Support","misc/Editors.htm"],
ja: ["AHKサポートエディタ","misc/Editors.htm"],

source: ["Enumerator Object","lib/Enumerator.htm"],
ja: ["Enumeratorオブジェクト","lib/Enumerator.htm"],

source: ["Environment","",
ja: ["環境","",

source: ["Error Object","lib/Error.htm"],
ja: ["Errorオブジェクト","lib/Error.htm"],

source: ["External Libraries","",
ja: ["外部ライブラリ","",

source: ["File Object","lib/File.htm"],
ja: ["Fileオブジェクト","lib/File.htm"],

source: ["File and Directory","",
ja: ["ファイルとディレクトリ","",

source: ["Flow of Control","",
ja: ["フロー制御","",

source: ["Frequently Asked Questions","FAQ.htm"],
ja: ["よくある質問","FAQ.htm"],

source: ["Func Object","lib/Func.htm"],
ja: ["Funcオブジェクト","lib/Func.htm"],

source: ["Function Index","lib/index.htm"],
ja: ["関数インデックス","lib/index.htm"],

source: ["Function Objects","misc/Functor.htm"],
ja: ["関数オブジェクト","misc/Functor.htm"],

source: ["Functions","Functions.htm"],
ja: ["関数","Functions.htm"],

source: ["Graphical User Interfaces","",
ja: ["グラフィカル・ユーザ・インタフェース","",

source: ["Gui ListView control","lib/ListView.htm"],
ja: ["Gui ListView コントロール","lib/ListView.htm"],

source: ["Gui Object","lib/Gui.htm"],
ja: ["Guiオブジェクト","lib/Gui.htm"],
